#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<stdlib.h>
//
////1.在屏幕上输出以下图案： 
////*
////***
////*****
////*******
////*********
////***********
////*************
////***********
////*********
////*******
////*****
////***
////*
//int main()
//{
//	int i,j,k,line;
//	//printf("请输入打印行数：\n");
//	//scanf("%d", &line);
//	for (i = 0; i <= 4; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	for (i = 0; i <= 3; i++)
//	{
//		for (j = i; j<=3; j++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	system("pause");
//}



////2.求出0～999之间的所有“水仙花数”并输出。 
//    /*“水仙花数”是指一个三位数，其各位数字的立方和确好等于该数本身，如；153＝1＋5＋3 ? ，则153是一个“水仙花数”。
//在数论中，水仙花数（Narcissistic number）也称为自恋数、自幂数、阿姆斯壮数或阿姆斯特朗数（Armstrong number），是指一N位数，其各个数之N次方和等于该数。
//例如153、370、371及407就是三位数的水仙花数，其各个数之立方和等于该数：
//153 = 1^3 + 5^3 + 3^3。
//370 = 3^3 + 7^3 + 0^3。
//371 = 3^3 + 7^3 + 1^3。
//407 = 4^3 + 0^3 + 7^3。
//*/
//int main()
//{
//	int i, a, b, c;
//	printf("0-999中水仙花数有：");
//	for (i = 0; i <1000; i++)
//	{
//		a = i % 10;//个位
//		b = (i / 10)%10;//十位
//		c = i / 100;//百位
//		if (i == a*a*a + b*b*b + c*c*c)
//		{
//			printf("%d ", i);
//		}
//	}
//	system("pause");
//	return 0;
//}



//3. 求Sn = a + aa + aaa + aaaa + aaaaa的前5项之和，其中a是一个数字，
//例如：2 + 22 + 222 + 2222 + 22222=24690
int main()
{
	int a=0;
	int sn = 0;
	int num = 0;
	scanf("%d", &num);
	int i;
	for (i = 0; i < 5; i++)
	{
		a = a * 10 + num;
		sn+=a;
	}
	printf("%d", sn);
	system("pause");
	return 0;
}